<script setup>

const first_line_cards = ref([{ label: 'Профессионализм и надежность', text: 'Наша юридическая компания специализируется на предоставлении полного спектра правовых услуг для бизнеса и частных клиентов. Мы оказываем поддержку в сложных правовых вопросах, консультируем и защищаем интересы наших клиентов на каждом этапе сотрудничества.' },
{ label: 'Команда экспертов', text: 'В команде — опытные юристы и адвокаты, обладающие глубокими знаниями в различных отраслях права, от корпоративного и налогового до семейного и наследственного права. Мы верим в индивидуальный подход и стремимся найти лучшее решение для каждой ситуации, основываясь на многолетнем опыте и актуальных правовых знаниях.' },
{ label: 'Наши ценности', text: 'Ответственность, честность и уважение к клиенту — это принципы, на которых строится наша работа. Мы уверены, что открытое общение и соблюдение профессиональной этики являются основой долгосрочных и доверительных отношений.' }])

const second_line_cards = ref([{ label: 'Ваши права — наша миссия', text: 'Наша компания объединяет лучших специалистов для решения любых юридических вопросов. Мы оказываем комплексные правовые услуги, помогаем клиентам справляться с кризисными ситуациями и обеспечиваем надежную правовую поддержку в делах любой сложности.' },
{ label: 'Комплексный подход', text: 'Мы предлагаем комплексный подход к каждому делу, разрабатываем стратегии и находим уникальные решения, которые отвечают нуждам наших клиентов. Независимо от сложности вопроса, мы обеспечиваем внимательное и персонализированное обслуживание для достижения результата.' },
{ label: 'Наши гарантии', text: 'Мы гарантируем профессионализм, четкость и ответственность в каждом нашем действии. Работаем с полной вовлеченностью, соблюдая все обязательства перед клиентом. Нам доверяют, и это доверие — основа нашей репутации.' }])

</script>

<template>
    <div class="page">

        <Header></Header>
        <div class="content_with_footer">
            <div class="content">
                <div class="first_line line">
                    <div v-for="card in first_line_cards">
                        <div class="card">
                            <p class="label">{{ card.label }}</p>
                            <p class="text"> {{ card.text }}</p>
                        </div>
                    </div>
                </div>
                <div class="second_line line">
                    <div v-for="card in second_line_cards">
                        <div class="card">
                            <p class="label">{{ card.label }}</p>
                            <p class="text"> {{ card.text }}</p>
                        </div>
                    </div>
                </div>

            </div>
            <Footer></Footer>
        </div>
    </div>
</template>

<style scoped>
.page {
    min-height: 100vh;
}

.content_with_footer {
    display: flex;
    flex-direction: column;
    height: 100vh;
}

.content {
    margin-top: 8rem;
    flex-grow: 1;
    display: flex;
    flex-direction: column;
}
.line {
display: flex;
flex-direction: row;
width: 100%;
padding: 3rem;
gap: 14rem;
}
.card {
    display: flex;
    flex-direction: column;
    width: 25vw;
    gap:2rem;
    background-color: var(--p-surface-300);
    border-radius: 1rem;
    padding: 2rem;
}
.label {
    font-size: 2rem;
}
.text {
    font-size: 1.5rem;
}
</style>